materials_properties_SI = {
    "Иридий": {"плотность (кг/м³)": 22560, "теплопроводность (Вт/(м·К))": 147},
    "Платина": {"плотность (кг/м³)": 21450, "теплопроводность (Вт/(м·К))": 71},
    "Золото": {"плотность (кг/м³)": 19320, "теплопроводность (Вт/(м·К))": 315},
    "Вольфрам": {"плотность (кг/м³)": 19250, "теплопроводность (Вт/(м·К))": 173},
    "Серебро": {"плотность (кг/м³)": 10490, "теплопроводность (Вт/(м·К))": 429},
    "Медь": {"плотность (кг/м³)": 8960, "теплопроводность (Вт/(м·К))": 401},
    "Никель": {"плотность (кг/м³)": 8900, "теплопроводность (Вт/(м·К))": 90.7},
    "Латунь": {"плотность (кг/м³)": 8400, "теплопроводность (Вт/(м·К))": 120},
    "Сталь": {"плотность (кг/м³)": 7850, "теплопроводность (Вт/(м·К))": 50},
    "Железо": {"плотность (кг/м³)": 7870, "теплопроводность (Вт/(м·К))": 80},
    "Олово": {"плотность (кг/м³)": 7310, "теплопроводность (Вт/(м·К))": 66},
    "Цинк": {"плотность (кг/м³)": 7140, "теплопроводность (Вт/(м·К))": 116},
    "Чугун": {"плотность (кг/м³)": 6800, "теплопроводность (Вт/(м·К))": 50},
    "Алмаз": {"плотность (кг/м³)": 3510, "теплопроводность (Вт/(м·К))": 2000},
    "Алюминий": {"плотность (кг/м³)": 2700, "теплопроводность (Вт/(м·К))": 235},
    "Мрамор": {"плотность (кг/м³)": 2650, "теплопроводность (Вт/(м·К))": 2.5},
    "Гранит": {"плотность (кг/м³)": 2750, "теплопроводность (Вт/(м·К))": 3.5},
    "Стекло": {"плотность (кг/м³)": 2500, "теплопроводность (Вт/(м·К))": 1.0},
    "Бетон": {"плотность (кг/м³)": 2400, "теплопроводность (Вт/(м·К))": 1.7},
    "Фарфор": {"плотность (кг/м³)": 2400, "теплопроводность (Вт/(м·К))": 1.2},
    "Графит": {"плотность (кг/м³)": 2200, "теплопроводность (Вт/(м·К))": 150},
    "Лёд": {"плотность (кг/м³)": 920, "теплопроводность (Вт/(м·К))": 2.2},
    "Парафин": {"плотность (кг/м³)": 800, "теплопроводность (Вт/(м·К))": 0.2},
    "Дуб (сухой)": {"плотность (кг/м³)": 750, "теплопроводность (Вт/(м·К))": 0.1},
    "Берёза (сухая)": {"плотность (кг/м³)": 650, "теплопроводность (Вт/(м·К))": 0.1},
    "Пробка": {"плотность (кг/м³)": 240, "теплопроводность (Вт/(м·К))": 0.04},
    "Платиноиридиевый сплав": {"плотность (кг/м³)": 21450, "теплопроводность (Вт/(м·К))": 70},
    "Свинец": {"плотность (кг/м³)": 11340, "теплопроводность (Вт/(м·К))": 35},
    "Ртуть": {"плотность (кг/м³)": 13560, "теплопроводность (Вт/(м·К))": 8.3},
    "Мёд": {"плотность (кг/м³)": 1420, "теплопроводность (Вт/(м·К))": 0.5},
    "Глицерин": {"плотность (кг/м³)": 1260, "теплопроводность (Вт/(м·К))": 0.2},
    "Молоко": {"плотность (кг/м³)": 1030, "теплопроводность (Вт/(м·К))": 0.5},
    "Морская вода": {"плотность (кг/м³)": 1025, "теплопроводность (Вт/(м·К))": 0.5},
    "Вода": {"плотность (кг/м³)": 1000, "теплопроводность (Вт/(м·К))": 0.6},
    "Подсолнечное масло": {"плотность (кг/м³)": 920, "теплопроводность (Вт/(м·К))": 0.15},
    "Нефть": {"плотность (кг/м³)": 800, "теплопроводность (Вт/(м·К))": 0.15},
    "Спирт / Этанол": {"плотность (кг/м³)": 789, "теплопроводность (Вт/(м·К))": 0.17},
    "Керосин": {"плотность (кг/м³)": 810, "теплопроводность (Вт/(м·К))": 0.1},
    "Бензин": {"плотность (кг/м³)": 740, "теплопроводность (Вт/(м·К))": 0.1},
    "Хлор": {"плотность (кг/м³)": 3.2, "теплопроводность (Вт/(м·К))": 0.0058},
    "Озон": {"плотность (кг/м³)": 2.14, "теплопроводность (Вт/(м·К))": 0.02},
    "Пропан": {"плотность (кг/м³)": 493, "теплопроводность (Вт/(м·К))": 0.17},
    "Углекислый газ": {"плотность (кг/м³)": 1.98, "теплопроводность (Вт/(м·К))": 0.016},
    "Кислород": {"плотность (кг/м³)": 1.429, "теплопроводность (Вт/(м·К))": 0.025},
    "Воздух": {"плотность (кг/м³)": 1.225, "теплопроводность (Вт/(м·К))": 0.025},
    "Азот": {"плотность (кг/м³)": 1.2506, "теплопроводность (Вт/(м·К))": 0.025},
    "Гелий": {"плотность (кг/м³)": 0.1786, "теплопроводность (Вт/(м·К))": 0.151},
    "Водород": {"плотность (кг/м³)": 0.00008988, "теплопроводность (Вт/(м·К))": 0.1805},
    "Неон": {"плотность (кг/м³)": 0.8999, "теплопроводность (Вт/(м·К))": 0.049}
}

materials = [
    "Иридий",
    "Платина",
    "Золото",
    "Вольфрам",
    "Серебро",
    "Медь",
    "Никель",
    "Латунь",
    "Сталь",
    "Железо",
    "Олово",
    "Цинк",
    "Чугун",
    "Алмаз",
    "Алюминий",
    "Мрамор",
    "Гранит",
    "Стекло",
    "Бетон",
    "Фарфор",
    "Графит",
    "Лёд",
    "Парафин",
    "Дуб (сухой)",
    "Берёза (сухая)",
    "Пробка",
    "Платиноиридиевый сплав",
    "Свинец",
    "Ртуть",
    "Мёд",
    "Глицерин",
    "Молоко",
    "Морская вода",
    "Вода",
    "Подсолнечное масло",
    "Нефть",
    "Спирт / Этанол",
    "Керосин",
    "Бензин",
    "Хлор",
    "Озон",
    "Пропан",
    "Углекислый газ",
    "Кислород",
    "Воздух",
    "Азот",
    "Гелий",
    "Водород",
    "Неон"
]
print("Список доступных материалов")
for material in materials:
    print(material)

print("Хотите добавить новый материал?")
answer = int(input("Напишите '0' если нет, или '1' если да"))
if answer:
    while True:
        name0 = input("введите название нового материала")
        materials.append(name0)
        materials_properties_SI[name0] = {"плотность (кг/м³)": input("введите значение плотности в (кг/м³)"), "теплопроводность (Вт/(м·К))": input("введите значение теплопроводности в (Вт/(м·К))")}
        print("Хотите добавить ещё новый материал?")
        if not int(input("Напишите '0' если нет, или '1' если да")):
            break
for material in materials:
    print(material)
material1 = input("введите название материала из списка") 
material2 = input("введите название материала из списка")

if material1 not in materials:
    print("Ошибка: материал отсутствует в списке. Пожалуйста, введите один из следующих материалов:")
    print("".join(material1))
else:
    print(f"Вы выбрали материал: {material1}")

if material2 not in materials:
    print("Ошибка: материал отсутствует в списке. Пожалуйста, введите один из следующих материалов:")
    print("".join(material2))
else:
    print(f"Вы выбрали материал: {material2}")


